# data cleaning

### Filtering

In [13]:
import pandas as pd
import numpy as np
from numpy import nan as NA
s1 = pd.Series([1,2,np.nan,4,np.nan,np.nan])

In [14]:
s1

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
5    NaN
dtype: float64

In [15]:
s1.isnull()

0    False
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [16]:
s1[s1.isnull()]

2   NaN
4   NaN
5   NaN
dtype: float64

In [17]:
s1[~s1.isnull()]

0    1.0
1    2.0
3    4.0
dtype: float64

In [18]:
s1.notnull()

0     True
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [19]:
s1[s1.notnull()]

0    1.0
1    2.0
3    4.0
dtype: float64

In [22]:
s1 = s1[s1.notnull()]

In [23]:
s1

0    1.0
1    2.0
3    4.0
dtype: float64

In [26]:
s1.index = [1,2,3]

In [27]:
s1

1    1.0
2    2.0
3    4.0
dtype: float64

In [28]:
s1.reset_index()

   index    0
0      1  1.0
1      2  2.0
2      3  4.0

In [30]:
s1.dropna()

1    1.0
2    2.0
3    4.0
dtype: float64

In [31]:
s1 = s1.dropna()

In [32]:
s1

1    1.0
2    2.0
3    4.0
dtype: float64

In [34]:
import pandas as pd
import numpy as np
from numpy import nan as NA
s1 = pd.Series([1,2,np.nan,4,np.nan,np.nan])

In [35]:
s1

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
5    NaN
dtype: float64

In [36]:
s1.dropna()

0    1.0
1    2.0
3    4.0
dtype: float64

In [37]:
s1

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
5    NaN
dtype: float64

In [39]:
s1.dropna(inplace=True)

In [40]:
s1

0    1.0
1    2.0
3    4.0
dtype: float64

In [41]:
from numpy import nan as NA
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [42]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [43]:
data.dropna() #only one value missing but it deletes the whole

     0    1    2
0  1.0  6.5  3.0

In [44]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [45]:
data.dropna(thresh=2) # 2 not none(numeric) values

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

### Filling na

In [46]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.626079       NaN       NaN
1 -0.269184       NaN       NaN
2 -0.659639       NaN -0.402312
3  0.817663       NaN -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [47]:
df.fillna(0)

          0         1         2
0 -0.626079  0.000000  0.000000
1 -0.269184  0.000000  0.000000
2 -0.659639  0.000000 -0.402312
3  0.817663  0.000000 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [48]:
df

          0         1         2
0 -0.626079       NaN       NaN
1 -0.269184       NaN       NaN
2 -0.659639       NaN -0.402312
3  0.817663       NaN -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [49]:
df.fillna({1: 1, 2: 2}) #column 1 no 1 sy fill hjaye ga and column 2 no 2 sy if column name is abc i will write abc instead

          0         1         2
0 -0.626079  1.000000  2.000000
1 -0.269184  1.000000  2.000000
2 -0.659639  1.000000 -0.402312
3  0.817663  1.000000 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [51]:
df.fillna(df.mean())

          0         1         2
0 -0.626079 -0.168379 -0.230882
1 -0.269184 -0.168379 -0.230882
2 -0.659639 -0.168379 -0.402312
3  0.817663 -0.168379 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [52]:
df.mean()

0    0.106002
1   -0.168379
2   -0.230882
dtype: float64

df.fillna({1: df[1].mean() , 2: df[2].mean()})

In [53]:
df.fillna({1: df[1].mean() , 2: df[2].mean()})

          0         1         2
0 -0.626079 -0.168379 -0.230882
1 -0.269184 -0.168379 -0.230882
2 -0.659639 -0.168379 -0.402312
3  0.817663 -0.168379 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [54]:
df.fillna(method="bfill") #backward fill

          0         1         2
0 -0.626079 -1.175998 -0.402312
1 -0.269184 -1.175998 -0.402312
2 -0.659639 -1.175998 -0.402312
3  0.817663 -1.175998 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [55]:
df.fillna(method="ffill") #forward fill

          0         1         2
0 -0.626079       NaN       NaN
1 -0.269184       NaN       NaN
2 -0.659639       NaN -0.402312
3  0.817663       NaN -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088  1.440116 -0.124385
6  0.223632 -0.769255 -0.619604

In [56]:
df[1][5] = NA

In [57]:
df

          0         1         2
0 -0.626079       NaN       NaN
1 -0.269184       NaN       NaN
2 -0.659639       NaN -0.402312
3  0.817663       NaN -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088       NaN -0.124385
6  0.223632 -0.769255 -0.619604

In [58]:
df.fillna(method="bfill") #backward fill

          0         1         2
0 -0.626079 -1.175998 -0.402312
1 -0.269184 -1.175998 -0.402312
2 -0.659639 -1.175998 -0.402312
3  0.817663 -1.175998 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088 -0.769255 -0.124385
6  0.223632 -0.769255 -0.619604

In [60]:
df.fillna(method="bfill",limit=1)

          0         1         2
0 -0.626079       NaN       NaN
1 -0.269184       NaN -0.402312
2 -0.659639       NaN -0.402312
3  0.817663 -1.175998 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088 -0.769255 -0.124385
6  0.223632 -0.769255 -0.619604

In [61]:
df.fillna(method="bfill",limit=2)

          0         1         2
0 -0.626079       NaN -0.402312
1 -0.269184       NaN -0.402312
2 -0.659639 -1.175998 -0.402312
3  0.817663 -1.175998 -0.534587
4  0.398530 -1.175998  0.526477
5  0.857088 -0.769255 -0.124385
6  0.223632 -0.769255 -0.619604

In [64]:
df[3] = np.nan

In [65]:
df

          0         1         2   3
0 -0.626079       NaN       NaN NaN
1 -0.269184       NaN       NaN NaN
2 -0.659639       NaN -0.402312 NaN
3  0.817663       NaN -0.534587 NaN
4  0.398530 -1.175998  0.526477 NaN
5  0.857088       NaN -0.124385 NaN
6  0.223632 -0.769255 -0.619604 NaN

### removing duplicate values

In [66]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 ....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [67]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [68]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [69]:
data.duplicated(["k1"])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [70]:
data.drop_duplicates(["k1"])

    k1  k2
0  one   1
1  two   1

In [71]:
data.drop_duplicates(["k2"])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [72]:
data.drop_duplicates(["k1", "k2"])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### Transforming Data Using a Function or Mapping

In [73]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 ....: 'Pastrami', 'corned beef', 'Bacon',
 ....: 'pastrami', 'honey ham', 'nova lox'],
 ....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [74]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [75]:
meat_to_animal = {
 'bacon': 'cow',
 'pulled pork': 'goat',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'goat',
 'nova lox': 'salmon'
}

In [76]:
meat_to_animal

{'bacon': 'cow',
 'pulled pork': 'goat',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'goat',
 'nova lox': 'salmon'}

In [77]:
meat_to_animal['bacon']

'cow'

In [78]:
data["food"]

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [82]:
upper_case = data["food"].str.upper()
upper_case

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [83]:
lower_case = data["food"].str.lower()
lower_case

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [85]:
a = lambda x: x.upper()
lower_case.map(a)    #map series p apply hga dataframe p apply nh hga usk lye applymap is used

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [86]:
data["animal"] = lower_case.map(meat_to_animal)

In [87]:
data

          food  ounces  animal
0        bacon     4.0     cow
1  pulled pork     3.0    goat
2        bacon    12.0     cow
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     cow
6     pastrami     3.0     cow
7    honey ham     5.0    goat
8     nova lox     6.0  salmon

In [88]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

### Replacing Values

In [90]:
#jsko replace krna hai,jssy replace krna hai
data.replace(-999,    np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [91]:
#replacing by arrays
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [92]:
#replacing by keys
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [93]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
 ....: index=['Ohio', 'Colorado', 'New York'],
 ....: columns=['one', 'two', 'three', 'four'])

In [94]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [96]:
data.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [97]:
transform = lambda x: x[:4].upper()

In [98]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [99]:
data.index = data.index.map(transform)

In [100]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [101]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [102]:
data.rename(index=str.title,columns=str.upper, inplace=True)

In [103]:
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11